// Напишите программу, которая принимает на вход
//два числа и проверяет, является ли одно число квадратом другого.

Console.WriteLine("Введите первое число");
int num1 = int.Parse(Console.ReadLine()??"0");

Console.WriteLine("Введите второе число");
int num2 = int.Parse(Console.ReadLine()??"0");


